[
  {"name": "Pythagorean Theorem", "structure": "In a right triangle, the square of the hypotenuse equals the sum of the squares of the other two sides. Formal: a^2 + b^2 = c^2"},
  {"name": "Euler Identity", "structure": "e^(iπ) + 1 = 0"},
  {"name": "Noether's Theorem", "structure": "Every differentiable symmetry of the action of a physical system has a corresponding conservation law."},
  {"name": "Gödel's Incompleteness Theorem", "structure": "Any consistent formal system rich enough to express arithmetic contains true statements that cannot be proven within the system."},
  {"name": "Boltzmann H Theorem", "structure": "The entropy of an isolated system not in equilibrium will tend to increase over time, approaching a maximum value."},
  {"name": "Quantum Gravity Bridge", "structure": "A quantum bridge can connect two regions of spacetime with minimal energy loss."},
  {"name": "Wormhole Energy Conservation", "structure": "The total energy in a traversable wormhole remains constant unless acted upon by external forces."},
  {"name": "Cantor's Theorem", "structure": "The set of all subsets of a set has strictly greater cardinality than the set itself."},
  {"name": "Lagrange's Theorem", "structure": "The order of a subgroup divides the order of the group."},
  {"name": "Stokes's Theorem", "structure": "Relates a surface integral of a vector field over a surface to a line integral around its boundary."},
  {"name": "No-hair Theorem", "structure": "All black hole solutions of the Einstein-Maxwell equations of gravitation and electromagnetism in general relativity can be completely characterized by only three externally observable classical parameters: mass, electric charge, and angular momentum."},
  {"name": "Goldstone's Theorem", "structure": "In quantum field theory, spontaneous breaking of continuous symmetries leads to the existence of massless bosons."},
  {"name": "Cayley-Hamilton Theorem", "structure": "Every square matrix satisfies its own characteristic equation."},
  {"name": "Virial Theorem", "structure": "Relates the average over time of the total kinetic energy with that of the total potential energy for a stable system bound by potential forces."},
  {"name": "Gödel's Completeness Theorem", "structure": "If a formula is logically valid, then it is provable."},
  {"name": "Compactness Theorem", "structure": "If every finite subset of a set of first-order sentences is satisfiable, then the whole set is satisfiable."},
  {"name": "Church-Turing Thesis", "structure": "Any function that can be computed by an algorithm can be computed by a Turing machine."},
  {"name": "Heine-Borel Theorem", "structure": "A subset of Euclidean space is compact if and only if it is closed and bounded."},
  {"name": "Lovelock's Theorem", "structure": "The only divergence-free, symmetric, rank-2 tensor that depends on the metric and its derivatives up to second order is a linear combination of the metric, the Einstein tensor, and the Gauss-Bonnet tensor."},
  {"name": "Tarski's Indefinability Theorem", "structure": "Truth in arithmetic cannot be defined within arithmetic itself."},
  {"name": "Borel Determinacy Theorem", "structure": "Every Borel game is determined; that is, one of the two players has a winning strategy."},
  {"name": "Kruskal's Tree Theorem", "structure": "In any infinite sequence of finite trees, one tree is homeomorphically embeddable into a later one."},
  {"name": "Lefschetz Fixed-Point Theorem", "structure": "For any continuous map from a compact topological space to itself, the number of fixed points is related to the trace of the induced map on homology."},
  {"name": "Pontryagin Duality Theorem", "structure": "The category of locally compact abelian groups is self-dual under the Pontryagin duality."},
  {"name": "Peter-Weyl Theorem", "structure": "Every compact topological group has a complete orthonormal set of matrix coefficients."},
  {"name": "Cauchy-Binet Formula", "structure": "Relates the determinant of the product of two matrices to the sum over products of minors."},
  {"name": "Quantum No-Cloning Theorem", "structure": "It is impossible to create an identical copy of an arbitrary unknown quantum state."},
  {"name": "Kochen-Specker Theorem", "structure": "It is impossible to assign definite values to all quantum mechanical observables in a way that is consistent with the functional relations between them."},
  {"name": "Vafa-Witten Theorem", "structure": "In certain supersymmetric gauge theories, there is no spontaneous breaking of parity or flavor symmetry."},
  {"name": "Wick's Theorem", "structure": "In quantum field theory, the time-ordered product of field operators can be expressed as a sum of normal-ordered products."},
  {"name": "Birkhoff's Theorem (Relativity)", "structure": "Any spherically symmetric solution of the vacuum field equations must be static and asymptotically flat."},
  {"name": "Lindström's Theorem", "structure": "Characterizes the maximality of first-order logic among abstract model-theoretic logics."},
  {"name": "Kleene's Recursion Theorem", "structure": "For any computable function, there exists an input that is a fixed point of the function."},
  {"name": "Löwenheim–Skolem Theorem", "structure": "If a first-order theory has an infinite model, then it has models of all infinite cardinalities."},
  {"name": "Morley's Categoricity Theorem", "structure": "If a countable first-order theory is categorical in one uncountable cardinality, then it is categorical in all uncountable cardinalities."},
  {"name": "Pascal's Theorem", "structure": "If a hexagon is inscribed in a conic section, then the three intersection points of pairs of opposite sides lie on a straight line."},
  {"name": "Thales's Theorem", "structure": "If A, B, and C are points on a circle where the line AC is a diameter, then the angle ABC is a right angle."},
  {"name": "Poincaré Duality Theorem", "structure": "Relates the kth cohomology group of a closed orientable manifold to its (n−k)th homology group."},
  {"name": "Seifert–van Kampen Theorem", "structure": "Describes the fundamental group of a topological space in terms of the fundamental groups of two overlapping subspaces."},
  {"name": "Hairy Ball Theorem", "structure": "There is no nonvanishing continuous tangent vector field on even-dimensional n-spheres."},
  {"name": "Jordan Curve Theorem", "structure": "Every simple closed curve in the plane divides the plane into an interior and an exterior region."},
  {"name": "Heine–Cantor Theorem", "structure": "Every continuous function on a compact metric space is uniformly continuous."},
  {"name": "Quantum No-Deleting Theorem", "structure": "It is impossible to delete one copy of an unknown quantum state."},
  {"name": "Parallel Axis Theorem", "structure": "The moment of inertia of a body about any axis is equal to the moment of inertia about a parallel axis through the center of mass plus the mass times the square of the distance between the axes."},
  {"name": "Perpendicular Axis Theorem", "structure": "The moment of inertia of a planar object about an axis perpendicular to the plane is equal to the sum of the moments of inertia about two perpendicular axes in the plane."},
  {"name": "Virial Theorem", "structure": "For a stable, bound system, the average total kinetic energy is related to the average total potential energy."},
  {"name": "Goldberg–Sachs Theorem", "structure": "A spacetime is algebraically special if and only if it admits a shear-free null geodesic congruence."},
  {"name": "Supersymmetry Nonrenormalization Theorems", "structure": "Certain quantities in supersymmetric theories are not renormalized by quantum corrections."},
  {"name": "Weinberg–Witten Theorem", "structure": "Massless particles of spin greater than one cannot carry a Lorentz-covariant conserved current."},
  {"name": "Wick's Theorem", "structure": "The time-ordered product of field operators can be expressed as a sum of normal-ordered products."}
  {"name": "Turing Universality in Fluid Dynamics", "structure": "Certain fluid systems can simulate any Turing machine."},
  {"name": "Stone's Representation Theorem", "structure": "Every Boolean algebra is isomorphic to a field of sets."},
  {"name": "Peter–Weyl Theorem", "structure": "Every compact topological group has a complete orthonormal set of matrix coefficients."},
  {"name": "Pontryagin Duality Theorem", "structure": "Relates locally compact abelian groups to their dual groups."},
  {"name": "Universal Approximation Theorem", "structure": "A feedforward neural network with a single hidden layer can approximate any continuous function on compact subsets of R^n."},
  {"name": "Lami's Theorem", "structure": "For a body in equilibrium under three coplanar, concurrent and non-collinear forces, the magnitude of each force is proportional to the sine of the angle between the other two."},
  {"name": "Liouville's Theorem (Hamiltonian)", "structure": "The phase space distribution function is constant along the trajectories of the system."},
  {"name": "C-theorem", "structure": "In two-dimensional quantum field theory, the central charge decreases along renormalization group flows."},
  {"name": "Cluster Decomposition Theorem", "structure": "Correlations between distant events in quantum field theory vanish as the separation increases."},
  {"name": "Coleman–Mandula Theorem", "structure": "The only possible symmetries of the S-matrix are direct products of the Poincaré group and internal symmetry groups."},
  {"name": "Elitzur's Theorem", "structure": "Local gauge symmetries cannot be spontaneously broken."},
  {"name": "Furry's Theorem", "structure": "The sum of all Feynman diagrams with an odd number of photon vertices vanishes."},
  {"name": "Gell-Mann and Low Theorem", "structure": "Relates the ground state of an interacting quantum system to that of a non-interacting system."},
  {"name": "Gleason's Theorem", "structure": "Characterizes measures on the closed subspaces of a Hilbert space."},
  {"name": "Haag's Theorem", "structure": "The interaction picture does not exist in quantum field theory."},
  {"name": "Haag–Łopuszański–Sohnius Theorem", "structure": "Extends the Coleman–Mandula theorem to include supersymmetry."},
  {"name": "Hellmann–Feynman Theorem", "structure": "The derivative of the energy of a quantum system with respect to a parameter is equal to the expectation value of the derivative of the Hamiltonian."},
  {"name": "Kinoshita–Lee–Nauenberg Theorem", "structure": "Infrared divergences cancel when summing over all degenerate initial and final states."},
  {"name": "No-deleting Theorem", "structure": "It is impossible to delete an unknown quantum state."},
  {"name": "Optical Equivalence Theorem", "structure": "Quantum and classical descriptions of optical fields are equivalent under certain conditions."},
  {"name": "Osterwalder–Schrader Theorem", "structure": "Provides conditions under which a Euclidean field theory can be continued to a relativistic quantum field theory."},
  {"name": "Pandya Theorem", "structure": "Relates the matrix elements of two-body operators in nuclear shell model calculations."},
  {"name": "Pomeranchuk's Theorem", "structure": "At high energies, the total cross sections for particle and antiparticle scattering off a target become equal."},
  {"name": "Supersymmetry Nonrenormalization Theorems", "structure": "Certain quantities in supersymmetric theories do not receive quantum corrections."},
  {"name": "Vafa–Witten Theorem", "structure": "Certain gauge theories cannot spontaneously break parity or time reversal symmetry."},
  {"name": "Weinberg–Witten Theorem", "structure": "Massless particles of spin greater than one cannot carry a Lorentz-covariant conserved current."},
  {"name": "Wick's Theorem", "structure": "Allows the computation of time-ordered products in terms of normal-ordered products."}
]